Cases/palette_convection/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Parameters
boxLength 0.5995;
boxWidth  0.3995;
boxHeight 0.3995;

negBoxLength -0.5995;
negBoxWidth -0.3995;
negBoxHeight  -0.3995;

actions
(
    {
        name    box0;
        type    cellZoneSet;
        action  remove;
    }
    {
        name    box1;
        type    cellZoneSet;
        action  remove;
    }
    {
        name    box2;
        type    cellZoneSet;
        action  remove;
    }
    {
        name    box3;
        type    cellZoneSet;
        action  remove;
    }
    {
        name    air;
        type    cellZoneSet;
        action  remove;
    }
    
    // Boxes
    {
        name    boxesCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0 0 0) ($boxLength $boxWidth $boxHeight );
    }
    {
        name    boxesCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     (0 $negBoxWidth 0) ($boxLength 0 $boxHeight );
    }
    {
        name    boxesCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     ($negBoxLength $negBoxWidth 0) (0 0  $boxHeight );
    }
    {
        name    boxesCellSet;
        type    cellSet;
        action  add;
        source  boxToCell;
        box     ($negBoxLength 0 0) (0 $boxWidth $boxHeight );
    }
    
    {
        name    boxes;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     boxesCellSet;
    }

    // shippingBox is all the other cells
    // {
    //     name    airCellSet;
    //     type    cellSet;
    //     action  new;
    //     source  cellToCell;
    //     set     boxesCellSet;
    // }
    // {
    //     name    airCellSet;
    //     type    cellSet;
    //     action  invert;
    // }
    // {
    //     name    air;
    //     type    cellZoneSet;
    //     action  new;
    //     source  setToCellZone;
    //     set     boxesCellSet;
    // }
);


// ************************************************************************* //
